results/rocm-640649/bench_suite_rocm.conc-scaling.in1024.out128.c32.log
/opt/venv/lib/python3.12/site-packages/tvm_ffi/_optional_torch_c_dlpack.py:181: UserWarning: Failed to JIT torch c dlpack extension, EnvTensorAllocator will not be enabled.
We recommend installing via `pip install torch-c-dlpack-ext`
  warnings.warn(
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x14a3386a7ba0>, trust_remote_code=False, seed=0, num_prompts=128, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://172.28.9.152:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=32, model='/iopsstor/scratch/cscs/anowak/hf_cache/hub/models--zai-org--GLM-5.3/snapshots/aca966e4e02791568aa6a4ced368624b3d897f42', input_len=None, output_len=None, tokenizer='/iopsstor/scratch/cscs/anowak/hf_cache/hub/models--zai-org--GLM-5.3/snapshots/aca966e4e02791568aa6a4ced368624b3d897f42', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-9f8ee5a3-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='glm-5.3', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-17 23:50:26 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [128, 128]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32

  0%|          | 0/128 [00:00<?, ?it/s]
  1%|          | 1/128 [00:53<1:52:25, 53.12s/it]
  2%|▏         | 2/128 [00:53<46:20, 22.07s/it]
  8%|▊         | 10/128 [00:53<05:41,  2.89s/it]
  9%|▉         | 12/128 [00:58<05:14,  2.71s/it]
 18%|█▊        | 23/128 [00:59<01:50,  1.05s/it]
 19%|█▉        | 24/128 [01:04<02:15,  1.30s/it]
 23%|██▎       | 29/128 [01:09<02:00,  1.22s/it]
 25%|██▌       | 32/128 [01:14<02:04,  1.29s/it]
 26%|██▌       | 33/128 [01:54<08:16,  5.22s/it]
 27%|██▋       | 35/128 [01:54<06:20,  4.09s/it]
 33%|███▎      | 42/128 [01:56<02:59,  2.09s/it]
 34%|███▎      | 43/128 [01:57<02:50,  2.00s/it]
 38%|███▊      | 48/128 [01:59<01:42,  1.28s/it]
 38%|███▊      | 49/128 [02:01<01:53,  1.43s/it]
 39%|███▉      | 50/128 [02:03<01:51,  1.42s/it]
 45%|████▌     | 58/128 [02:04<00:47,  1.48it/s]
 46%|████▌     | 59/128 [02:07<01:02,  1.10it/s]
 47%|████▋     | 60/128 [02:09<01:09,  1.03s/it]
 49%|████▉     | 63/128 [02:14<01:21,  1.25s/it]
 50%|█████     | 64/128 [02:16<01:24,  1.33s/it]
 51%|█████     | 65/128 [03:01<08:59,  8.57s/it]
 52%|█████▏    | 67/128 [03:01<05:57,  5.86s/it]
 55%|█████▍    | 70/128 [03:03<03:35,  3.71s/it]
 57%|█████▋    | 73/128 [03:04<02:15,  2.47s/it]
 59%|█████▉    | 76/128 [03:07<01:44,  2.01s/it]
 62%|██████▏   | 79/128 [03:09<01:13,  1.49s/it]
 66%|██████▌   | 84/128 [03:13<00:53,  1.21s/it]
 66%|██████▋   | 85/128 [03:15<00:54,  1.26s/it]
 72%|███████▏  | 92/128 [03:21<00:38,  1.06s/it]
 75%|███████▌  | 96/128 [03:26<00:37,  1.17s/it]
 76%|███████▌  | 97/128 [04:07<02:36,  5.04s/it]
 77%|███████▋  | 99/128 [04:08<01:55,  3.98s/it]
 79%|███████▉  | 101/128 [04:09<01:25,  3.15s/it]
 80%|████████  | 103/128 [04:09<00:59,  2.40s/it]
 84%|████████▎ | 107/128 [04:10<00:31,  1.49s/it]
 85%|████████▌ | 109/128 [04:10<00:22,  1.19s/it]
 89%|████████▉ | 114/128 [04:11<00:10,  1.36it/s]
 91%|█████████ | 116/128 [04:12<00:07,  1.62it/s]
 95%|█████████▍| 121/128 [04:12<00:03,  2.32it/s]
 96%|█████████▌| 123/128 [04:13<00:01,  2.67it/s]
 98%|█████████▊| 126/128 [04:14<00:00,  2.89it/s]
 99%|█████████▉| 127/128 [04:14<00:00,  2.96it/s]
100%|██████████| 128/128 [04:14<00:00,  1.99s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     128
Failed requests:                         0
Maximum request concurrency:             32
Benchmark duration (s):                  254.39
Total input tokens:                      132608
Total generated tokens:                  16384
Request throughput (req/s):              0.50
Output token throughput (tok/s):         64.40
Peak output token throughput (tok/s):    128.00
Peak concurrent requests:                43.00
Total token throughput (tok/s):          585.68
---------------Time to First Token----------------
Mean TTFT (ms):                          10451.54
Median TTFT (ms):                        10100.37
P99 TTFT (ms):                           21837.87
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          412.11
Median TPOT (ms):                        408.26
P99 TPOT (ms):                           482.64
---------------Inter-token Latency----------------
Mean ITL (ms):                           418.58
Median ITL (ms):                         324.13
P99 ITL (ms):                            1699.87
==================================================