results/rocm-640649/bench_suite_rocm.conc-scaling.in1024.out128.c64.log
/opt/venv/lib/python3.12/site-packages/tvm_ffi/_optional_torch_c_dlpack.py:181: UserWarning: Failed to JIT torch c dlpack extension, EnvTensorAllocator will not be enabled.
We recommend installing via `pip install torch-c-dlpack-ext`
  warnings.warn(
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x1472393cbba0>, trust_remote_code=False, seed=0, num_prompts=256, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://172.28.9.152:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='/iopsstor/scratch/cscs/anowak/hf_cache/hub/models--zai-org--GLM-5.3/snapshots/aca966e4e02791568aa6a4ced368624b3d897f42', input_len=None, output_len=None, tokenizer='/iopsstor/scratch/cscs/anowak/hf_cache/hub/models--zai-org--GLM-5.3/snapshots/aca966e4e02791568aa6a4ced368624b3d897f42', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-487f247b-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='glm-5.3', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-17 23:55:04 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [128, 128]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64

  0%|          | 0/256 [00:00<?, ?it/s]
  0%|          | 1/256 [01:13<5:11:16, 73.24s/it]
  1%|          | 2/256 [01:13<2:08:31, 30.36s/it]
  4%|▍         | 10/256 [01:16<17:23,  4.24s/it]
 10%|█         | 26/256 [01:17<04:49,  1.26s/it]
 11%|█▏        | 29/256 [01:21<04:49,  1.28s/it]
 15%|█▍        | 38/256 [01:23<03:00,  1.21it/s]
 15%|█▌        | 39/256 [01:28<03:55,  1.08s/it]
 18%|█▊        | 46/256 [01:29<02:41,  1.30it/s]
 18%|█▊        | 47/256 [01:35<03:49,  1.10s/it]
 21%|██▏       | 55/256 [01:37<02:21,  1.42it/s]
 22%|██▏       | 56/256 [01:42<03:24,  1.02s/it]
 23%|██▎       | 59/256 [01:43<02:58,  1.11it/s]
 23%|██▎       | 60/256 [01:48<04:11,  1.28s/it]
 25%|██▌       | 65/256 [02:35<15:06,  4.75s/it]
 26%|██▌       | 66/256 [02:36<13:48,  4.36s/it]
 26%|██▌       | 67/256 [02:37<12:06,  3.84s/it]
 27%|██▋       | 70/256 [02:40<08:42,  2.81s/it]
 30%|███       | 78/256 [02:45<04:41,  1.58s/it]
 34%|███▎      | 86/256 [02:52<03:30,  1.24s/it]
 39%|███▉      | 100/256 [02:59<02:10,  1.19it/s]
 42%|████▏     | 107/256 [03:00<01:40,  1.48it/s]
 42%|████▏     | 108/256 [03:05<02:14,  1.10it/s]
 45%|████▍     | 115/256 [03:12<02:10,  1.08it/s]
 48%|████▊     | 123/256 [03:19<01:58,  1.12it/s]
 50%|████▉     | 127/256 [03:20<01:42,  1.25it/s]
 50%|█████     | 128/256 [03:26<02:21,  1.10s/it]
 50%|█████     | 129/256 [04:06<09:48,  4.63s/it]
 51%|█████     | 130/256 [04:08<08:59,  4.28s/it]
 52%|█████▏    | 134/256 [04:11<05:52,  2.89s/it]
 55%|█████▌    | 142/256 [04:16<03:12,  1.68s/it]
 58%|█████▊    | 149/256 [04:22<02:26,  1.37s/it]
 61%|██████▏   | 157/256 [04:28<01:52,  1.14s/it]
 64%|██████▍   | 164/256 [04:30<01:17,  1.19it/s]
 64%|██████▍   | 165/256 [04:35<01:39,  1.10s/it]
 67%|██████▋   | 172/256 [04:42<01:29,  1.06s/it]
 70%|██████▉   | 179/256 [04:43<00:58,  1.31it/s]
 70%|███████   | 180/256 [04:49<01:20,  1.06s/it]
 72%|███████▏  | 185/256 [04:50<00:58,  1.20it/s]
 73%|███████▎  | 188/256 [04:56<01:10,  1.03s/it]
 74%|███████▍  | 189/256 [04:57<01:13,  1.10s/it]
 75%|███████▌  | 193/256 [05:38<04:28,  4.27s/it]
 76%|███████▌  | 194/256 [05:39<04:04,  3.94s/it]
 77%|███████▋  | 198/256 [05:41<02:27,  2.54s/it]
 80%|████████  | 205/256 [05:42<01:10,  1.39s/it]
 83%|████████▎ | 212/256 [05:43<00:39,  1.12it/s]
 86%|████████▌ | 219/256 [05:45<00:23,  1.58it/s]
 88%|████████▊ | 226/256 [05:45<00:12,  2.33it/s]
 89%|████████▊ | 227/256 [05:46<00:13,  2.16it/s]
 91%|█████████▏| 234/256 [05:47<00:07,  2.85it/s]
 94%|█████████▍| 241/256 [05:48<00:03,  4.17it/s]
 95%|█████████▍| 243/256 [05:48<00:03,  3.71it/s]
 96%|█████████▌| 245/256 [05:49<00:02,  3.98it/s]
 98%|█████████▊| 250/256 [05:50<00:01,  4.44it/s]
 98%|█████████▊| 252/256 [05:50<00:00,  4.71it/s]
100%|█████████▉| 255/256 [05:51<00:00,  4.32it/s]
100%|██████████| 256/256 [05:51<00:00,  4.23it/s]
100%|██████████| 256/256 [05:51<00:00,  1.37s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     256
Failed requests:                         0
Maximum request concurrency:             64
Benchmark duration (s):                  351.59
Total input tokens:                      265216
Total generated tokens:                  32768
Request throughput (req/s):              0.73
Output token throughput (tok/s):         93.20
Peak output token throughput (tok/s):    255.00
Peak concurrent requests:                80.00
Total token throughput (tok/s):          847.53
---------------Time to First Token----------------
Mean TTFT (ms):                          15542.40
Median TTFT (ms):                        11930.44
P99 TTFT (ms):                           38810.69
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          557.55
Median TPOT (ms):                        569.25
P99 TPOT (ms):                           669.19
---------------Inter-token Latency----------------
Mean ITL (ms):                           566.88
Median ITL (ms):                         335.98
P99 ITL (ms):                            1888.97
==================================================